<template>
  <div class="info">
    <div class="top">
      <div class="header">
        <div class="header__text">
          <p class="header__name">Константин</p>
          <span class="header__post">Администратор</span>
        </div>

        <div class="header__exit">
          <div class="header__circle">
            <i class="bx bx-left-arrow-alt header__icon"></i>
          </div>
          <a href="#" class="header__link">Выйти</a>
        </div>
      </div>

      <div class="offer">
        <Head :company="company" />
      </div>
    </div>

    <div class="wrapper">
      <Plan :plans="plans" />
    </div>
  </div>
</template>

<script>
import "./Info.scss";
import Plan from "@/components/commons/Plan/Plan";
import Head from "@/components/commons/Head/Head";

export default {
  name: "Info",
  components: {
    Plan,
    Head,
  },
  data() {
    return {
      company: {
        number: "№13534774376",
        name:
          "Публичное акционерное общество / Территориальная генерирующая компания №2",
        status: "Просроченная заявка",
        tag: "Ждет ответ 3д 12ч",
      },
      plans: [
        {
          status: {
            info: "adopted",
            title: "Изменения приняты",
          },
          info: [
            {
              title: "Договор",
              descr: "44-5-10001",
            },
            {
              title: "Площадка",
              descr: "ТЭЦ-2",
            },
            {
              title: "Адрес площадки",
              descr:
                "156009, Костромская обл, Кострома г, Красная Байдарка ул, дом №2",
            },
          ],
          table: {
            head: [
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
            ],
            last: [
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
            ],
            new: [
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
            ],
          },
        },
        {
          status: {
            info: "rejected",
            title: "Изменения отклонены",
          },
          info: [
            {
              title: "Договор",
              descr: "44-5-10001",
            },
            {
              title: "Площадка",
              descr: "ТЭЦ-2",
            },
            {
              title: "Адрес площадки",
              descr:
                "156009, Костромская обл, Кострома г, Красная Байдарка ул, дом №2",
            },
          ],
          table: {
            head: [
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
              "16.09.2019",
            ],
            last: [
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
            ],
            new: [
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
              "5 234,000",
            ],
          },
        },
      ],
    };
  },
};
</script>
